`timescale 1ns / 1ps  // 定义时间单位：1纳秒为单位，精度为1皮秒

// Testbench 模块没有输入输出引脚，因为它是一个封闭的宇宙
module tb_DAS_Core();

    // ==========================================
    // 1. 定义仪表盘连线 (Inputs 用 reg，Outputs 用 wire)
    // ==========================================
    // 凡是要我们手动给信号的（模拟外部环境），都定义为 reg（寄存器）
    reg         clk;
    reg         rst_n;
    reg         adc_valid;
    reg  [11:0] adc_ch0;
    reg  [9:0]  delay_ch0;
    
    // 凡是用来接收发动机输出结果的，都定义为 wire（导线）
    wire [11:0] delayed_data_ch0;

    // ==========================================
    // 2. 把发动机搬上测试台 (例化模块)
    // ==========================================
    // UUT (Unit Under Test) 是行业黑话，意思是"被测单元"
    // .端口名(连线名) 的语法，就是把上面的线，插到发动机对应的接口上
    DAS_Core uut (
        .clk              (clk),
        .rst_n            (rst_n),
        .adc_valid        (adc_valid),
        .adc_ch0          (adc_ch0),
        .delay_ch0        (delay_ch0),
        .delayed_data_ch0 (delayed_data_ch0)
    );

    // ==========================================
    // 3. 供电车间：生成 50MHz 系统时钟
    // ==========================================
    // 50MHz 的周期是 20纳秒(ns)。所以每过 10ns 翻转一次电平。
    initial clk = 0; // 开机时钟为低电平
    always #10 clk = ~clk; // "#10" 意思是等待 10ns。"~" 意思是取反。

    // ==========================================
    // 4. 模拟环境车间：喂入假数据 (核心测试逻辑)
    // ==========================================
    initial begin
        // --- 阶段一：开机与复位 ---
        // 初始状态，所有信号清零
        rst_n      = 0;  // 按下复位按键
        adc_valid  = 0;
        adc_ch0    = 12'd0;
        delay_ch0  = 10'd5; // 【关键设置】我们让它倒退 5 个点！
        
        #100; // 让系统在复位状态下待 100ns
        rst_n = 1; // 松开复位按键，系统激活！
        #20;  // 再等一个时钟周期

        // --- 阶段二：探头开始接收数据 ---
        adc_valid = 1; // 告诉 FPGA，数据有效了，开干！
        
        // 这是一个简单的 for 循环，我们给 FPGA 连续喂 20 个递增的数据
        // 模拟 ADC 采进来的电压值：10, 11, 12, 13...
        repeat(20) begin
            adc_ch0 = adc_ch0 + 1'b1; // 数据每次加 1
            #20; // 停留 20ns（刚好是一个时钟周期），等 FPGA 吞进去
        end

        // --- 阶段三：测试结束 ---
        adc_valid = 0; // 停止发数据
        #100;
        $finish; // 停止仿真，告诉 Vivado 收工！
    end

endmodule